Revit 2026 API
VertexStreamPositionColored Methods
The VertexStreamPositionColored type exposes the following members.
Methods
Name | Description
AddVertex |  Inserts a VertexStreamPositionColored into the stream and associated buffer.
AddVertices
Dispose
(Inherited from VertexStream)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
VertexStreamPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace